<template>
  <v-card>
    <v-card-title>
      ระบบจัดการคำถาม
      <v-spacer></v-spacer>
      <v-text-field
        v-model="search"
        append-icon="mdi-magnify"
        label="Search"
        single-line
        hide-details
      ></v-text-field>
    </v-card-title>
    <v-data-table :search="search" :headers="headers" :items="desserts">
      <template v-slot:item.I="{ item }">
        <router-link to="/edit"><v-icon small @click="edit(item)"> mdi-pencil </v-icon></router-link>
        
        <router-link to="/view"><v-icon small @click="view(item)"> mdi-eye </v-icon></router-link>
      
    </template>
    </v-data-table>
  </v-card>
  
</template>


<script>
  export default {


  methods: {
    edit(link) {
      this.$router.push(link).catch((err) => {});
    },
  },

    data () {
      return {
        search: '',
        headers: [
          {
            text: 'ลำดับ',
            align: 'start',sortable: false,value: 'name',
          },
          { text: 'หมวดคำถาม', value: 'MQ' },
          { text: 'คำถาม', value: 'Q' },
          { text: 'การจัดการ', value: 'I',sortable: false},          
        ],
        desserts: [
          {
            name: '1',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้ประกอบธุรกิจตรวจสอบมาตรฐานสินค้าต้องรายงานประจำเดือนการตรวจสอบ มส.20 ภายในกี่วัน',                       
          },
          
          {
            name: '2',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'มาตรการ CVD คืออะไร',                       
          },
          {
            name: '3',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'DUI คืออะไร	',                       
          },
          {
            name: '4',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'มาตรการเยียวยาทางการค้า คืออะไร	',                       
          },
          {
            name: '5',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ตรวจสอบกิจกรรมของ APi ได้จากช่องทางใด	',                       
          },
          {
            name: '6',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'Dual-Use Items คืออะไร',                       
          },
          {
            name: '7',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ตรวจสอบกิจกรรมของสถาบันส่งเสริมสินค้าเกษตรนวัตกรรม ได้จากช่องทางใด',                       
          },
          {
            name: '8',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'มาตรการตอบโต้การอุดหนุน คืออะไร	',                       
          },
          {
            name: '9',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ชำระเงินค่าธรรมเนียม มส. ผ่านช่องทางใดได้บ้าง	',                       
          },
          {
            name: '10',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้ตรวจสอบมาตรฐานสินค้า ทำหน้าที่อะไร	',                       
          },
          {
            name: '11',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ถ้าผู้ตรวจสอบมาตรฐานสินค้า มีการเปลี่ยนแปลงชื่อสกุล จะต้องทำอย่างไร	',                       
          },
          {
            name: '12',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้ตรวจสอบมาตรฐานสินค้า แบ่งออกเป็นกี่ประเภท	',                       
          },
          {
            name: '13',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ตรวจสอบกฎถิ่นกำเนิดสินค้าได้จากช่องทางใด	',                       
          },
          {
            name: '14',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้ประกอบธุรกิจตรวจสอบมาตรฐานสินค้าทำหน้าที่อะไร',                       
          },
          {
            name: '15',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'Institute for Agricultural Product Innovation สนับสนุนผู้ประกอบการอย่างไร',                       
          },
          {
            name: '16',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'APi คืออะไร',                       
          },
          {
            name: '17',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้เกี่ยวข้องกับพระราชบัญญัติสินค้าการแพร่ขยายอาวุธอานุภาพทำลายล้างสูง พ.ศ. 2562 ได้แก่ใครบ้าง',                       
          },
          {
            name: '18',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'หากใบอนุญาตของผู้ตรวจสอบมาตรฐานสินค้าสูญหาย จะต้องทำอย่างไร',                       
          },
          {
            name: '19',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ผู้ส่งกลับสินค้าที่ใช้ได้สองทางไปนอกราชอาณาจักรต้องเตรียมตัวอย่างไรบ้าง',                       
          },
          {
            name: '20',
            MQ: 'คำถามทั่วไปเกี่ยวกับบริการของกรม',
            Q: 'ระบบ REX คืออะไร',                       
          },

          
        ],
      }
    },
  }
</script>
 
<style>

</style>